# Index Changing(Index Degistirme)

In [7]:
import numpy as np

In [8]:
import pandas as pd

In [9]:
arr = np.random.rand(3, 4)

In [10]:
arr

array([[0.89144309, 0.01140642, 0.0593403 , 0.60096416],
       [0.20829625, 0.2469045 , 0.94731366, 0.08535762],
       [0.4524247 , 0.91503017, 0.82145119, 0.44118022]])

In [15]:
arr = pd.DataFrame(data=arr, index=['Ali', 'Ayse', 'Husnu'], columns=['Maas', 'Yas', 'Calisma Saati', 'Boy'])

### reset_index()  fonksiyonunu kullanalim;

reset_index; bazi senaryolarda indexe ihtiyacimiz olabilir. Bu sebeple bu fonksiyonu kullanabiliriz.

In [16]:
arr

           Maas       Yas  Calisma Saati       Boy
Ali    0.891443  0.011406       0.059340  0.600964
Ayse   0.208296  0.246904       0.947314  0.085358
Husnu  0.452425  0.915030       0.821451  0.441180

In [17]:
arr.reset_index()

   index      Maas       Yas  Calisma Saati       Boy
0    Ali  0.891443  0.011406       0.059340  0.600964
1   Ayse  0.208296  0.246904       0.947314  0.085358
2  Husnu  0.452425  0.915030       0.821451  0.441180

#### Degisikliklerin yerinde uygulanmasi icin inplace fonksiyonuna True degerini vermemiz lazim

In [19]:
arr

           Maas       Yas  Calisma Saati       Boy
Ali    0.891443  0.011406       0.059340  0.600964
Ayse   0.208296  0.246904       0.947314  0.085358
Husnu  0.452425  0.915030       0.821451  0.441180

Tablomuza Yeni Column Ekleyelim...

In [23]:
yeniIndexListesi = ['Al', 'Ay', 'Hu']

In [24]:
arr['Yeni Index'] = yeniIndexListesi

In [25]:
arr

           Maas       Yas  Calisma Saati       Boy Yeni Index
Ali    0.891443  0.011406       0.059340  0.600964         Al
Ayse   0.208296  0.246904       0.947314  0.085358         Ay
Husnu  0.452425  0.915030       0.821451  0.441180         Hu

#### Index numaralarini degistirmek istersek;

once yeni Column eklemeliyiz daha sonra o Column'u tasimaliyiz.

In [28]:
arr.set_index('Yeni Index')

                Maas       Yas  Calisma Saati       Boy
Yeni Index
Al          0.891443  0.011406       0.059340  0.600964
Ay          0.208296  0.246904       0.947314  0.085358
Hu          0.452425  0.915030       0.821451  0.441180

inplace=True kullanmadigimiz icin degisiklikler gecici oldu!

In [29]:
arr

           Maas       Yas  Calisma Saati       Boy Yeni Index
Ali    0.891443  0.011406       0.059340  0.600964         Al
Ayse   0.208296  0.246904       0.947314  0.085358         Ay
Husnu  0.452425  0.915030       0.821451  0.441180         Hu

In [30]:
arr.set_index('Yeni Index', inplace=True)

In [31]:
arr

                Maas       Yas  Calisma Saati       Boy
Yeni Index
Al          0.891443  0.011406       0.059340  0.600964
Ay          0.208296  0.246904       0.947314  0.085358
Hu          0.452425  0.915030       0.821451  0.441180

In [32]:
arr.loc['Al']

Maas             0.891443
Yas              0.011406
Calisma Saati    0.059340
Boy              0.600964
Name: Al, dtype: float64